eisup_2019_docmng_integration/src/Documents/ttk_НазначениеОтвественныхЗаЗагрузкуБиллинга/ttk_НазначениеОтвественныхЗаЗагрузкуБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НазначениеОтвественныхЗаЗагрузкуБиллинга</name>
  <registerRecords>InformationRegister.ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга</registerRecords>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипБиллинга</name>
      <type>
        <types>CatalogRef.абс_ТипыБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветственного</name>
      <type>
        <types>EnumRef.ttk_ТипыОтветственныхПриЗагрузкеБиллинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга/ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБиллинга</name>
    <type>
      <types>CatalogRef.абс_ТипыБиллинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОтветственного</name>
    <type>
      <types>EnumRef.ttk_ТипыОтветственныхПриЗагрузкеБиллинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_НазначениеОтвественныхЗаЗагрузкуБиллинга/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	НаборЗаписей = РегистрыСведений.ttk_ОтветственныеЗаЗагрузкуПроверкуБиллинга.СоздатьНаборЗаписей(); 
	
	Для Каждого Строка Из Ответственные Цикл
	
	
		

		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 

		НоваяЗапись 					= НаборЗаписей.Добавить(); 
		НоваяЗапись.Период 				= Ссылка.Дата; 
		НоваяЗапись.Организация 		= Строка.Организация; 
		НоваяЗапись.ТипОтветственного	= Строка.ТипОтветственного; 
		НоваяЗапись.ТипБиллинга			= Строка.ТипБиллинга; 
		НоваяЗапись.Ответственный 		= Строка.Ответственный; 

		
	КонецЦикла;
	
	
	НаборЗаписей.Записать(); 

	ЭтотОбъект.Изменил = глЗначениеПеременной("глТекущийПользователь");

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЭтотОбъект.Изменил = глЗначениеПеременной("глТекущийПользователь");
		
КонецПроцедуры
